Tekla Open API Reference for Tekla Structures 2025
ContainerView.GetViews Method
 Gets all the views that are placed on the container view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetViews()
Public Function GetViews As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
The views that are placed on the container view.
See Also
Reference
ContainerView Class
Tekla.Structures.Drawing Namespace